/*
_______________________________________№1 Подключаем JS файл___________________________________________
Смотри HTML_L.html
*/

/*
_______________________________________№2 Правила именования___________________________________________

Идентификатор - это специальное слово которое позволяет нам обратиться к области памяти 
                либо выполнить какие-то действия. Обратиться либо к переменной 
                либо к функции
В JS считается что именем переменной или именем фукнции необходимо правильно писать и исользовать
такие имена.

Под переменной мы скрываем какую-то число строку или значение true/false
Такие обращения к таким областям памяти к значениям называются переменными.

в JS для того чтобы обозначить переменную используют несколько способов

1 Латинскими буквами
2 С маленькой буквы
3 Если переменая должна состоять из двух значений(слов) тогда нужно писать в стиле camelCase
где каждое последующее слово начинается с заглавной буквы getElementById


Комментарий может быть однострочным //  закоментировать строку Ctrl + /
                       многострочным/* ... */ // Данные строки не будут восприниматься js

/*



*/
